// 挂载在常驻物体或直接作为静态类使用
public static class FishDataConfig
{
    // 12种鱼的刷新权重（对应策划表左侧数值）
    public static readonly int[] SpawnWeights = new int[]
    {
       2300,2000,1700,400,1400,500,350,300,350,250,250,200

    };

    // 捕捉概率 [鱼索引, 炮台等级] = 万分比捕捉值
    // 炮台等级 0~4 对应5个炮台（低到高）
    public static readonly int[,] CatchRates = new int[,]
    {
        { 9000, 9200, 9400, 9600, 9800 }, // 鱼1
        { 7500, 7800, 8000, 8500, 9000 }, // 鱼2
        { 5500, 6500, 7000, 8000, 9000 }, // 鱼3
        { 1000, 1500, 3200, 5000, 6000 }, // 鱼4
        { 3000, 6000, 7300, 7500, 8000 }, // 鱼5
        { 200,  800, 1800, 2200, 3000 },  // 鱼6
        { 1000, 1500, 3200, 5000, 6000 }, // 鱼7
        { 100,  200,  250, 1100, 2400 },  // 鱼8
        { 20,   30,  120,  600, 1800 },   // 鱼9
        { 1,    10,   60,  300, 1500 },   // 鱼10
        { 1,    1,    10,   50, 1000 },   // 鱼11
        { 1,    1,    1,    20,  300 }    // 鱼12
    };
}